<?php

$msg = [

    "lucky" => [

        "title"   => "You are a lucky person !!! ",
        "comment" => "My Galleryは、まだ、どなたも登録していません。\nあなたが最初です。\nさあ、アカウントを登録しましょう。",

    ],


    "wwllcome" => [

        "title"   => "Wellcome !!! ",
        "comment" => " 様、ご利用ありがとうございます。\nアルバムを登録しましょう。",

    ],

    "logout" => [

        "msg01" => "ログアウトしました。",
        "msg02" => " 様、ご利用ありがとうございました。",

    ],

    "resign" => [

        "msg01" => "退会しました。",
        "msg02" => " 様、またのご利用をお待ちしております。",

    ],

    "mail" => [

        "commit" => " 様、お問い合わせをありがとうございす。\nしばらくお待ちください",

    ],

    "about" => [

        "title"   => "My Galleryとは？",
        "comment1" => "どなたでも、自由にアルバムを作成することができます。\nスライドショーで写真を楽しめます。\n",
        "comment2" => "今すぐ、アカウントを登録しましょう。",

    ],

];
