<?php

$errMsg = [

    "login" => [
        "account_err" => "メールアドレスかパスワードに誤りがあります。",
    ],

    "required" => [

        "name"      => "氏名を入力してください。",
        "zip"       => "郵便番号を入力してください。",
        "address"   => "住所を入力してください。",
        "tel"       => "電話番号を入力してください。",
        "email"     => "メールアドレスを入力してください。",
        "password"  => "パスワードを入力してください。",
        "profile"   => "プロフィールを入力してください。",
        "title"     => "タイトルを入力してください。",
        "comment"   => "コメントを入力してください。",
        "contact"   => "お問い合わせ内容を入力してください。",

    ],

    "format" => [

        "date"       => "生年月日を正しく選択してください。",
        "zip"       => "郵便番号の形式が正しくありません。",
        "tel"       => "電話番号の形式が正しくありません。",
        "email"     => "メールアドレスの形式が正しくありません。",
        "password"  => "パスワードの形式が正しくありません。",
        "file"      => "画像名は半角英数字、'-'、'_'を使用してください。",

    ],

    "match" => [

        "email"     => "メールアドレスが一致しません。",
        "password"  => "パスワードが一致しません。",

    ],

    "registered" => [

        "email" => "メールアドレスは既に使用されています。",
        "file"  => "選択された画像は既に登録されています。",

    ],

    "range" => [

        "name"          => "名前は20桁以内です。",
        "address"       => "住所は50桁以内です。",
        "password"      => "パスワードは半角英数字で5桁以上10桁以内です。",
        "profile"       => "プロフィールは100桁以内です。",
        "title"         => "タイトルは20桁以内です。",
        "comment"       => "コメントは100桁以内です。",

    ],

    "file" => [

        "unSelected"    => "画像を選択してください。",
        "larger"        => "画像サイズが大きすぎます。",
        "unSupported"   => "画像形式が未対応です。",
        "unMadeDir"     => "画像保存用のディレクトリを作成できませんでした。",
        "unFindedDir"   => "画像保存用のディレクトリがありませんでした。",
        "unDeletedDir"  => "画像保存用のディレクトリを削除することができませんでした。",
        "unExisted"     => "削除する画像がありませんでした。",
        "unSaved"       => "画像を保存することができませんでした。",
        "unDeleted"     => "画像を削除することができませんでした。",
        "otherErr"      => "その他のエラーが発生しました",
    ],

];
